------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  F:\OneDrive - The Pennsylvania State University\Academic\Publication_Sub\AmishCovid202302_Censu
> s2020Pop\results/s3.1_xtnbreg_irr.log
  log type:  text
 opened on:  15 Mar 2023, 21:24:29

. 
. *==========================================================
. * tutorials
. *==========================================================
. ** Non-negative Continuous Right-skewed Panel Data
. ** https://www.statalist.org/forums/forum/general-stata-discussion/general/1590559-non-negative-continuous
> -right-skewed-zero-inflated-panel-data-analysis
. 
. ** Negative Binomial Regression
. ** https://stats.oarc.ucla.edu/stata/dae/negative-binomial-regression/
. 
. ** Model A Continuous DV With [0, âˆž] Range
. ** https://stats.stackexchange.com/questions/142134/how-should-i-model-a-continuous-dependent-variable-in-
> the-0-infty-range
. 
. *==========================================================
. * macro IVs
. *==========================================================
. // local ivs amishpct evang_no_amish colle trump2020 hhincmed1000
. 
. local ivs amishpct evang_no_amish trump2020 hhincmed1000

. 
. // *==========================================================
. // * compile median and average hhinc in 2020
. // *==========================================================
. // infile using "$data/R13277287.dct", using("$data/R13277287_SL050.txt")
. // rename FIPS countyfips
. // rename A14006_001 hhincmed2020
. // rename A14008_001 hhincavg2020
. // gen hhincmed_1000_2020 = hhincmed2020 / 1000
. // gen hhincavg_1000_2020 = hhincavg2020 / 1000
. // keep countyfips hhinc*
. 
. // tempfile hhinc2020
. // save `hhinc2020'
. 
. *==========================================================
. * daily model: all counties
. *==========================================================
. use "$data/resdata_daily.dta", clear

. xtset countynum datevar
       panel variable:  countynum (strongly balanced)
        time variable:  datevar, 01feb2021 to 26oct2022, but with gaps
                delta:  1 day

. 
. xtnbreg dr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .7460237
Iteration 2: tolerance = .39374236
Iteration 3: tolerance = .14356075
Iteration 4: tolerance = .016829
Iteration 5: tolerance = .00369313
Iteration 6: tolerance = .0001924
Iteration 7: tolerance = 1.832e-06
Iteration 8: tolerance = 1.295e-08

GEE population-averaged model                   Number of obs     =    185,640
Group variable:                  countynum      Number of groups  =        357
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =        520
Correlation:                  exchangeable                    avg =      520.0
                                                              max =        520
                                                Wald chi2(5)      =     628.87
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            dr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9852173   .0019358    -7.58   0.000     .9814306    .9890187
evang_no_amish |   .9988327   .0006641    -1.76   0.079     .9975319    1.000135
     trump2020 |   .9892097   .0008193   -13.10   0.000     .9876051    .9908169
  hhincmed1000 |   1.003201   .0009653     3.32   0.001     1.001311    1.005095
               |
           met |
    Non-metro  |   1.014221   .0168531     0.85   0.395     .9817212    1.047796
               |
         _cons |   .1730357   .0153907   -19.72   0.000     .1453535      .20599
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.32    0.755413
evang_no_a~h |      3.66    0.273122
   trump2020 |     34.04    0.029378
hhincmed1000 |     17.93    0.055771
       0.met |      4.77    0.209772
-------------+----------------------
    Mean VIF |     12.34

. collin `ivs' met
(obs=185,640)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.12    1.06    0.8890      0.1110
evang_no_amish      1.36    1.17    0.7337      0.2663
 trump2020      1.69    1.30    0.5930      0.4070
hhincmed1000      1.54    1.24    0.6488      0.3512
       met      1.33    1.15    0.7526      0.2474
----------------------------------------------------
  Mean VIF      1.41

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2026          1.0000
    2     0.9006          2.1602
    3     0.6046          2.6366
    4     0.2678          3.9614
    5     0.0204         14.3463
    6     0.0040         32.5250
---------------------------------
 Condition Number        32.5250 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4044

. predict dr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr dr dr_predict if e(sample)
(obs=185,640)

             |       dr dr_pre~t
-------------+------------------
          dr |   1.0000
  dr_predict |   0.0574   1.0000


. di r(rho) ^ 2
.00329222

. outreg2 using "$results/xtnbreg_irr.doc", replace stats(coef se) ///
>         label nodepvar ctitle("daily_all") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * daily model: 1%
. *==========================================================
. use "$data/resdata_daily.dta", clear

. drop if amishpct < 1
(96,720 observations deleted)

. xtset countynum datevar
       panel variable:  countynum (strongly balanced)
        time variable:  datevar, 01feb2021 to 26oct2022, but with gaps
                delta:  1 day

. 
. xtnbreg dr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .7467367
Iteration 2: tolerance = .39328474
Iteration 3: tolerance = .14181212
Iteration 4: tolerance = .01370362
Iteration 5: tolerance = .00471726
Iteration 6: tolerance = .00017955
Iteration 7: tolerance = 2.125e-06
Iteration 8: tolerance = 1.183e-08

GEE population-averaged model                   Number of obs     =     88,920
Group variable:                  countynum      Number of groups  =        171
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =        520
Correlation:                  exchangeable                    avg =      520.0
                                                              max =        520
                                                Wald chi2(5)      =     285.12
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            dr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9847297   .0021874    -6.93   0.000     .9804517    .9890263
evang_no_amish |   .9990644   .0009989    -0.94   0.349     .9971086    1.001024
     trump2020 |    .989202   .0012118    -8.86   0.000     .9868296      .99158
  hhincmed1000 |   1.003353   .0018759     1.79   0.073     .9996826    1.007036
               |
           met |
    Non-metro  |   .9880687   .0348809    -0.34   0.734      .922015    1.058855
               |
         _cons |   .1755979   .0271904   -11.23   0.000     .1296328    .2378612
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.66    0.602640
evang_no_a~h |      3.92    0.254858
   trump2020 |     43.62    0.022925
hhincmed1000 |     23.21    0.043081
       0.met |      8.09    0.123597
-------------+----------------------
    Mean VIF |     16.10

. collin `ivs' met
(obs=88,920)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.24    1.11    0.8074      0.1926
evang_no_amish      1.45    1.21    0.6884      0.3116
 trump2020      1.65    1.28    0.6074      0.3926
hhincmed1000      1.57    1.25    0.6365      0.3635
       met      1.19    1.09    0.8414      0.1586
----------------------------------------------------
  Mean VIF      1.42

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2602          1.0000
    2     0.8721          2.2102
    3     0.5722          2.7287
    4     0.2758          3.9305
    5     0.0166         16.0277
    6     0.0031         37.1790
---------------------------------
 Condition Number        37.1790 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4231

. predict dr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr dr dr_predict if e(sample)
(obs=88,920)

             |       dr dr_pre~t
-------------+------------------
          dr |   1.0000
  dr_predict |   0.0523   1.0000


. di r(rho) ^ 2
.00273473

. outreg2 using "$results/xtnbreg_irr.doc", append stats(coef se) ///
>         label nodepvar ctitle("daily_1%") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * weekly model: all counties
. *==========================================================
. use "$data/resdata_weekly.dta", clear

. xtset countynum weekly
       panel variable:  countynum (strongly balanced)
        time variable:  weekly, 2021w5 to 2022w43
                delta:  1 week

. 
. xtnbreg wr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .76671652
Iteration 2: tolerance = .4021464
Iteration 3: tolerance = .15550232
Iteration 4: tolerance = .02336732
Iteration 5: tolerance = .00372311
Iteration 6: tolerance = .00029334
Iteration 7: tolerance = 3.500e-06
Iteration 8: tolerance = 1.616e-08

GEE population-averaged model                   Number of obs     =     32,487
Group variable:                  countynum      Number of groups  =        357
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =         91
Correlation:                  exchangeable                    avg =       91.0
                                                              max =         91
                                                Wald chi2(5)      =     538.62
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            wr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9849194   .0020994    -7.13   0.000     .9808133    .9890428
evang_no_amish |   .9992125   .0006841    -1.15   0.250     .9978727    1.000554
     trump2020 |   .9891031   .0008564   -12.65   0.000     .9874261     .990783
  hhincmed1000 |   1.003607   .0011208     3.22   0.001     1.001412    1.005806
               |
           met |
    Non-metro  |   .9992352   .0187258    -0.04   0.967     .9631992    1.036619
               |
         _cons |   .1552048   .0150888   -19.16   0.000     .1282781    .1877836
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.32    0.755413
evang_no_a~h |      3.66    0.273122
   trump2020 |     34.04    0.029378
hhincmed1000 |     17.93    0.055771
       0.met |      4.77    0.209772
-------------+----------------------
    Mean VIF |     12.34

. collin `ivs' met
(obs=32,487)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.12    1.06    0.8890      0.1110
evang_no_amish      1.36    1.17    0.7337      0.2663
 trump2020      1.69    1.30    0.5930      0.4070
hhincmed1000      1.54    1.24    0.6488      0.3512
       met      1.33    1.15    0.7526      0.2474
----------------------------------------------------
  Mean VIF      1.41

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2026          1.0000
    2     0.9006          2.1602
    3     0.6046          2.6366
    4     0.2678          3.9614
    5     0.0204         14.3463
    6     0.0040         32.5250
---------------------------------
 Condition Number        32.5250 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4044

. predict wr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr wr wr_predict if e(sample)
(obs=32,487)

             |       wr wr_pre~t
-------------+------------------
          wr |   1.0000
  wr_predict |   0.1027   1.0000


. di r(rho) ^ 2
.01054661

. outreg2 using "$results/xtnbreg_irr.doc", append stats(coef se) ///
>         label nodepvar ctitle("weekly_all") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * weekly model: 1%
. *==========================================================
. use "$data/resdata_weekly.dta", clear

. drop if amishpct < 1
(16,926 observations deleted)

. xtset countynum weekly
       panel variable:  countynum (strongly balanced)
        time variable:  weekly, 2021w5 to 2022w43
                delta:  1 week

. 
. xtnbreg wr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .76492209
Iteration 2: tolerance = .40058083
Iteration 3: tolerance = .15185445
Iteration 4: tolerance = .0182246
Iteration 5: tolerance = .00552596
Iteration 6: tolerance = .00026968
Iteration 7: tolerance = 2.681e-06
Iteration 8: tolerance = 1.559e-08

GEE population-averaged model                   Number of obs     =     15,561
Group variable:                  countynum      Number of groups  =        171
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =         91
Correlation:                  exchangeable                    avg =       91.0
                                                              max =         91
                                                Wald chi2(5)      =     236.87
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            wr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9841781   .0023377    -6.71   0.000      .979607    .9887705
evang_no_amish |   .9993554   .0010167    -0.63   0.526     .9973647     1.00135
     trump2020 |   .9892274   .0012875    -8.32   0.000     .9867071    .9917541
  hhincmed1000 |   1.003256    .001963     1.66   0.097     .9994155    1.007111
               |
           met |
    Non-metro  |   .9739218   .0393937    -0.65   0.514     .8996928    1.054275
               |
         _cons |   .1607935   .0265675   -11.06   0.000     .1163126     .222285
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.66    0.602640
evang_no_a~h |      3.92    0.254858
   trump2020 |     43.62    0.022925
hhincmed1000 |     23.21    0.043081
       0.met |      8.09    0.123597
-------------+----------------------
    Mean VIF |     16.10

. collin `ivs' met
(obs=15,561)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.24    1.11    0.8074      0.1926
evang_no_amish      1.45    1.21    0.6884      0.3116
 trump2020      1.65    1.28    0.6074      0.3926
hhincmed1000      1.57    1.25    0.6365      0.3635
       met      1.19    1.09    0.8414      0.1586
----------------------------------------------------
  Mean VIF      1.42

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2602          1.0000
    2     0.8721          2.2102
    3     0.5722          2.7287
    4     0.2758          3.9305
    5     0.0166         16.0277
    6     0.0031         37.1790
---------------------------------
 Condition Number        37.1790 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4231

. predict wr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr wr wr_predict if e(sample)
(obs=15,561)

             |       wr wr_pre~t
-------------+------------------
          wr |   1.0000
  wr_predict |   0.0915   1.0000


. di r(rho) ^ 2
.00837358

. outreg2 using "$results/xtnbreg_irr.doc", append stats(coef se) ///
>         label nodepvar ctitle("weekly_1%") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * monthly model: all counties
. *==========================================================
. use "$data/resdata_monthly.dta", clear

. xtset countynum monthly
       panel variable:  countynum (strongly balanced)
        time variable:  monthly, 2021m2 to 2022m10
                delta:  1 month

. 
. xtnbreg mr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .76886159
Iteration 2: tolerance = .40310706
Iteration 3: tolerance = .15701437
Iteration 4: tolerance = .02455607
Iteration 5: tolerance = .00347226
Iteration 6: tolerance = .00028722
Iteration 7: tolerance = 3.415e-06
Iteration 8: tolerance = 1.522e-08

GEE population-averaged model                   Number of obs     =      7,497
Group variable:                  countynum      Number of groups  =        357
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =         21
Correlation:                  exchangeable                    avg =       21.0
                                                              max =         21
                                                Wald chi2(5)      =     552.80
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            mr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9848638   .0020829    -7.21   0.000     .9807899    .9889546
evang_no_amish |   .9991874   .0006634    -1.22   0.221     .9978881    1.000488
     trump2020 |   .9891327   .0008503   -12.71   0.000     .9874676    .9908006
  hhincmed1000 |    1.00372   .0011126     3.35   0.001     1.001542    1.005904
               |
           met |
    Non-metro  |   1.002374   .0182755     0.13   0.897     .9671869    1.038841
               |
         _cons |   .1529803   .0147204   -19.51   0.000     .1266863    .1847318
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.32    0.755413
evang_no_a~h |      3.66    0.273122
   trump2020 |     34.04    0.029378
hhincmed1000 |     17.93    0.055771
       0.met |      4.77    0.209772
-------------+----------------------
    Mean VIF |     12.34

. collin `ivs' met
(obs=7,497)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.12    1.06    0.8890      0.1110
evang_no_amish      1.36    1.17    0.7337      0.2663
 trump2020      1.69    1.30    0.5930      0.4070
hhincmed1000      1.54    1.24    0.6488      0.3512
       met      1.33    1.15    0.7526      0.2474
----------------------------------------------------
  Mean VIF      1.41

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2026          1.0000
    2     0.9006          2.1602
    3     0.6046          2.6366
    4     0.2678          3.9614
    5     0.0204         14.3463
    6     0.0040         32.5250
---------------------------------
 Condition Number        32.5250 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4044

. predict mr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr mr mr_predict if e(sample)
(obs=7,497)

             |       mr mr_pre~t
-------------+------------------
          mr |   1.0000
  mr_predict |   0.1245   1.0000


. di r(rho) ^ 2
.01550647

. outreg2 using "$results/xtnbreg_irr.doc", append stats(coef se) ///
>         label nodepvar ctitle("monthly_all") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * monthly model: 1%
. *==========================================================
. use "$data/resdata_monthly.dta", clear

. drop if amishpct < 1
(3,906 observations deleted)

. xtset countynum monthly
       panel variable:  countynum (strongly balanced)
        time variable:  monthly, 2021m2 to 2022m10
                delta:  1 month

. 
. xtnbreg mr `ivs' i.b1.met, pa irr vce(robust)

Iteration 1: tolerance = .76689167
Iteration 2: tolerance = .40149338
Iteration 3: tolerance = .15332449
Iteration 4: tolerance = .01945678
Iteration 5: tolerance = .00522535
Iteration 6: tolerance = .00025744
Iteration 7: tolerance = 2.421e-06
Iteration 8: tolerance = 1.402e-08

GEE population-averaged model                   Number of obs     =      3,591
Group variable:                  countynum      Number of groups  =        171
Link:                                  log      Obs per group:
Family:             negative binomial(k=1)                    min =         21
Correlation:                  exchangeable                    avg =       21.0
                                                              max =         21
                                                Wald chi2(5)      =     245.56
Scale parameter:                         1      Prob > chi2       =     0.0000

                                (Std. Err. adjusted for clustering on countynum)
--------------------------------------------------------------------------------
               |             Semirobust
            mr |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      amishpct |   .9841009   .0023157    -6.81   0.000     .9795727      .98865
evang_no_amish |   .9993739   .0010043    -0.62   0.533     .9974075    1.001344
     trump2020 |   .9892571   .0012785    -8.36   0.000     .9867544    .9917661
  hhincmed1000 |    1.00335   .0019608     1.71   0.087     .9995142      1.0072
               |
           met |
    Non-metro  |   .9771694   .0385755    -0.59   0.559     .9044137    1.055778
               |
         _cons |   .1585573   .0259717   -11.24   0.000     .1150163    .2185815
--------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate (conditional on zero random effects).

. vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
    amishpct |      1.66    0.602640
evang_no_a~h |      3.92    0.254858
   trump2020 |     43.62    0.022925
hhincmed1000 |     23.21    0.043081
       0.met |      8.09    0.123597
-------------+----------------------
    Mean VIF |     16.10

. collin `ivs' met
(obs=3,591)

  Collinearity Diagnostics

                        SQRT                   R-
  Variable      VIF     VIF    Tolerance    Squared
----------------------------------------------------
  amishpct      1.24    1.11    0.8074      0.1926
evang_no_amish      1.45    1.21    0.6884      0.3116
 trump2020      1.65    1.28    0.6074      0.3926
hhincmed1000      1.57    1.25    0.6365      0.3635
       met      1.19    1.09    0.8414      0.1586
----------------------------------------------------
  Mean VIF      1.42

                           Cond
        Eigenval          Index
---------------------------------
    1     4.2602          1.0000
    2     0.8721          2.2102
    3     0.5722          2.7287
    4     0.2758          3.9305
    5     0.0166         16.0277
    6     0.0031         37.1790
---------------------------------
 Condition Number        37.1790 
 Eigenvalues & Cond Index computed from scaled raw sscp (w/ intercept)
 Det(correlation matrix)    0.4231

. predict mr_predict if e(sample)
(option mu assumed; Exponentiated linear prediction)

. corr mr mr_predict if e(sample)
(obs=3,591)

             |       mr mr_pre~t
-------------+------------------
          mr |   1.0000
  mr_predict |   0.1127   1.0000


. di r(rho) ^ 2
.01269103

. outreg2 using "$results/xtnbreg_irr.doc", append stats(coef se) ///
>         label nodepvar ctitle("monthly_1%") ///
>         dec(3) alpha(0.001, 0.01, 0.05, 0.10) symbol(***, **, *, +)
results/xtnbreg_irr.doc
dir : seeout

. 
. *==========================================================
. * end logging
. *==========================================================
. clear

. log close _all
      name:  <unnamed>
       log:  F:\OneDrive - The Pennsylvania State University\Academic\Publication_Sub\AmishCovid202302_Censu
> s2020Pop\results/s3.1_xtnbreg_irr.log
  log type:  text
 closed on:  15 Mar 2023, 21:25:32
------------------------------------------------------------------------------------------------------------
